package com.example.mhsunbreaksimulator.dto;

import java.math.BigDecimal;

import lombok.Data;

@Data
public class ShotSkillModifier {

    /*
     * =====================================================
     * 射撃系スキル補正
     * =====================================================
     *
     * 通常弾・連射矢強化
     * 貫通弾・貫通矢強化
     * 散弾・拡散矢強化
     * 速射強化
     *
     * などを、
     *
     * 「現在選択している矢種・弾種」
     *
     * に合わせて適用するための補正値。
     */


    /*
     * =====================================================
     * 物理ダメージ倍率
     * =====================================================
     */
    private BigDecimal physicalMultiplier
            = BigDecimal.ONE;


    /*
     * =====================================================
     * 属性ダメージ倍率
     * =====================================================
     *
     * 通常弾・連射矢強化などは
     * 基本的に物理側のみ。
     *
     * 速射強化など、
     * 属性弾にも影響する補正はこちらにも入れる。
     */
    private BigDecimal elementMultiplier
            = BigDecimal.ONE;
}